app/views/aircrafts/_form.html.erb

SELECT "airports".* FROM "airports"
---
    <%= f.label :current_airport, 'Текущая станция' %>
    <%= f.collection_select :current_airport_id, Airport.all, :id, :title %>