app/views/aircrafts/show.html.erb

SELECT  "places".* FROM "places" WHERE "places"."aircraft_id" = ? ORDER BY "places"."id" ASC LIMIT ?  [["aircraft_id", 24], ["LIMIT", 1]]
---
    <strong> Конфигурация:  </strong>
    <% @aircraft.places.each do |place| %>