app/views/tickets/_form.html.erb

SELECT  "aircrafts".* FROM "aircrafts" ORDER BY "aircrafts"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    <%= f.label :aircraft, 'Самолет' %>
    <%= f.collection_select :aircraft_id, Aircraft.all, :id, :model %>

SELECT "users".* FROM "users"
---
      <%= f.label :user, 'Пассажир' %>
      <%= f.collection_select :user_id, User.all, :id, :last_name %>