app/views/tickets/show.html.erb

    <strong>Самолет:</strong>
    <% if @ticket.aircraft.present? %>
---
SELECT  "aircrafts".* FROM "aircrafts" WHERE "aircrafts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    <strong>Пассажир:</strong>
    <% if @ticket.user.present? %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]