app/views/airports/show.html.erb

SELECT  1 AS one FROM "routes" INNER JOIN "airports_routes" ON "routes"."id" = "airports_routes"."route_id" WHERE "airports_routes"."airport_id" = ? LIMIT ?  [["airport_id", 1], ["LIMIT", 1]]
SELECT "routes".* FROM "routes" INNER JOIN "airports_routes" ON "routes"."id" = "airports_routes"."route_id" WHERE "airports_routes"."airport_id" = ? ORDER BY "airports_routes"."id" ASC  [["airport_id", 1]]
---
    <strong>Маршрут:</strong>
      <% if @airport.routes.empty? %>