app/controllers/aircrafts_controller.rb

SELECT "aircrafts".* FROM "aircrafts"
---
  def index
    @aircrafts = Aircraft.all

INSERT INTO "aircrafts" ("model", "created_at", "updated_at", "current_airport_id", "place_id") VALUES (?, ?, ?, ?, ?)  [["model", "op"], ["created_at", "2018-01-18 11:10:35.511512"], ["updated_at", "2018-01-18 11:10:35.511512"], ["current_airport_id", 1], ["place_id", 1]]
---
  def create
    @aircraft = Aircraft.new(aircraft_params)

    if @aircraft.save

UPDATE "aircrafts" SET "current_airport_id" = ?, "updated_at" = ? WHERE "aircrafts"."id" = ?  [["current_airport_id", 1], ["updated_at", "2017-12-24 14:55:30.967198"], ["id", 13]]
---
  def update
    if @aircraft.update(aircraft_params)

DELETE FROM "aircrafts" WHERE "aircrafts"."id" = ?  [["id", 1]]
---
  def destroy
    @aircraft.destroy

SELECT  "aircrafts".* FROM "aircrafts" WHERE "aircrafts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_aircraft
    @aircraft = Aircraft.find(params[:id])