app/controllers/airports_controller.rb

  def index
    @airports = Airport.all
---
SELECT "airports".* FROM "airports"

  def create
    @airport = Airport.new(airport_params)

    if @airport.save
---
INSERT INTO "airports" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "DME Домодедово, Москва."], ["created_at", "2017-11-26 12:42:31.256509"], ["updated_at", "2017-11-26 12:42:31.256509"]]

  def update
    if @airport.update(airport_params)
---
UPDATE "airports" SET "title" = ?, "updated_at" = ? WHERE "airports"."id" = ?  [["title", "th"], ["updated_at", "2017-12-24 12:10:03.336026"], ["id", 9]]

  def destroy
    @airport.destroy
---
DELETE FROM "airports" WHERE "airports"."id" = ?  [["id", 7]]

  def update_position
    @route = Route.find(params[:route_id])
---
SELECT  "routes".* FROM "routes" WHERE "routes"."id" = ? LIMIT ?  [["id", 69], ["LIMIT", 1]]

    def set_airport
      @airport = Airport.find(params[:id])
---
SELECT  "airports".* FROM "airports" WHERE "airports"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]