app/controllers/places_controller.rb

SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @place = Place.find(params[:id])

INSERT INTO "places" ("title", "economy_seats", "business_seats", "aircraft_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Двухтипная"], ["economy_seats", 40], ["business_seats", 15], ["aircraft_id", 34], ["created_at", "2018-01-25 14:35:48.721438"], ["updated_at", "2018-01-25 14:35:48.721438"]]
---
  def create
    @place = @aircraft.places.new(place_params)

    if @place.save

SELECT  "aircrafts".* FROM "aircrafts" WHERE "aircrafts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_aircraft
    @aircraft = Aircraft.find(params[:aircraft_id])