app/controllers/routes_controller.rb

SELECT "routes".* FROM "routes" ORDER BY "routes"."id" ASC
---
  def index
    @routes = Route.all

INSERT INTO "routes" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "fgh"], ["created_at", "2017-12-23 14:36:48.164086"], ["updated_at", "2017-12-23 14:36:48.164086"]]
---
  def create
    @route = Route.new(name: params[:route][:name],
                       airport_ids: params[:route][:airport_ids])
    if @route.save

UPDATE "routes" SET "name" = ?, "updated_at" = ? WHERE "routes"."id" = ?  [["name", "Москва - Симферопольd"], ["updated_at", "2017-12-23 14:37:54.451143"], ["id", 2]]
---
  def update
    if @route.update(name: params[:route][:name],
                     airport_ids: params[:route][:airport_ids])

DELETE FROM "routes" WHERE "routes"."id" = ?  [["id", 3]]
---
  def destroy
    @route.destroy

SELECT  "routes".* FROM "routes" WHERE "routes"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def set_route
    @route = Route.find(params[:id])