app/controllers/tickets_controller.rb

  def create
    @ticket= Ticket.new(ticket_params)

    if @ticket.save
---
INSERT INTO "tickets" ("name", "created_at", "updated_at", "user_id", "aircraft_id") VALUES (?, ?, ?, ?, ?)  [["name", "RK34"], ["created_at", "2017-12-28 13:12:42.620809"], ["updated_at", "2017-12-28 13:12:42.620809"], ["user_id", 1], ["aircraft_id", 1]]

  def update
    if @ticket.update(ticket_params)
---
UPDATE "tickets" SET "aircraft_id" = ?, "user_id" = ?, "updated_at" = ? WHERE "tickets"."id" = ?  [["aircraft_id", 1], ["user_id", 1], ["updated_at", "2018-01-03 13:39:15.321452"], ["id", 3]]