app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "rt"], ["last_name", "gtyu"], ["created_at", "2017-12-23 17:20:02.076333"], ["updated_at", "2017-12-23 17:20:02.076333"]]