app/views/routes/_form.html.erb

      <%= f.label :airport_ids, 'Аэропорт' %><br>
      <%= f.collection_select :airport_ids,
                                 Airport.all, :id, :title, {},
                                 { multiple: true } %>
---
SELECT "airports".* FROM "airports"