app/views/routes/show.html.erb

SELECT  1 AS one FROM "airports" INNER JOIN "airports_routes" ON "airports"."id" = "airports_routes"."airport_id" WHERE "airports_routes"."route_id" = ? LIMIT ?  [["route_id", 28], ["LIMIT", 1]]
SELECT "airports".* FROM "airports" INNER JOIN "airports_routes" "airports_routes_airports" ON "airports_routes_airports"."airport_id" = "airports"."id" INNER JOIN "airports_routes" ON "airports"."id" = "airports_routes"."airport_id" WHERE "airports_routes"."route_id" = ? ORDER BY "airports_routes"."id" ASC, airports_routes.position DESC  [["route_id", 1]]
---

    <% if @route.airports.present? %>